// Центр карты
const CITY_CENTER = [51.250500, 51.434500]; 

// Точки старта и финиша (на основе первых и последних координат)
const locations = {
    mall: [51.249381, 51.438677],   // Старт (AZIA MALL)
    school: [51.252159, 51.430443]  // Финиш (НИШ)
};

// 1. ОПАСНЫЙ ПУТЬ (Тот, что пробивающий, длинный массив)
const routeFast = {
    id: "route_fast",
    name: "Кратчайший (через дворы)",
    coords: [
        [51.249482, 51.438682],
        [51.249302, 51.438198],
        [51.249792, 51.437853],
        [51.249677, 51.437496],
        [51.249598, 51.437243],
        [51.250174, 51.436736],
        [51.250023, 51.436149],
        [51.252322, 51.434088],
        [51.251245, 51.430652],
        [51.251946, 51.429864],
        [51.252186, 51.430507],
        [51.252238, 51.430507]
    ],
    // Новая система рейтингов (Много штрафов):
    isLit: false,           // Нет света (-20 ночью)
    hasCCTV: false,         // Нет камер
    hasGuard: false,        // Нет охраны
    highTraffic: false,     // Пустынно
    hasSidewalk: false,     // Идем по грязи/дворам
    hasConstruction: false, // Нет стройки
    hasAbandoned: false,     // Рядом гаражи и заброшки (-40 баллов!)
    nearMisses: 0           // Стартуем с 2 жалоб для демо (-20 баллов)
};

// 2. БЕЗОПАСНЫЙ ПУТЬ (Тот, что покороче массив)
const routeSafe = {
    id: "route_safe",
    name: "Безопасный (TuraJol)",
    coords: [
        [51.249387, 51.438635],
        [51.249306, 51.438276],
        [51.249764, 51.437860],
        [51.249638, 51.437387],
        [51.250096, 51.436985],
        [51.248686, 51.433027],
        [51.251674, 51.429970],
        [51.252159, 51.430443]
    ],
    // Новая система рейтингов (Максимум безопасности):
    isLit: true,            // Освещено (+30)
    hasCCTV: true,          // Камеры ТЦ и школы (+20)
    hasGuard: true,         // Охрана (+25)
    highTraffic: true,      // Оживленно (+15)
    hasSidewalk: true,      // Есть тротуар (+10)
    hasConstruction: false, // Нет стройки
    hasAbandoned: false,    // Нет заброшек
    nearMisses: 0           // Жалоб нет
};